/*
  对于有父子节点的表结构数据来说，可能会遇到先按父级排序，再按字迹排序的场景，
  例：A、a1、a2、B、b1、b2
  假设有张表table_a，结构为：
  ---------------------------
  id | pid | sort_num  | yxbz
  ---------------------------
  1  | 0   | 1         | Y
  2  | 0   | 2         | Y
  10 | 1   | 1         | Y
  11 | 1   | 2         | Y
  20 | 2   | 1         | Y
  ......
  ---------------------------
  现在按照先父级排序，紧跟着父级后的是子级排序
*/
-- 向下递归，先父级排序，后紧跟着父级的子级再排序
select t.*,
       level -- 层级
from table_a t
where t.yxbz = 'Y' -- 查询条件
start with t.pid = 0 -- 指定查询的起始节点
connect by prior t.id = t.pid -- 定义父子关系，prior后跟的字段决定递归方向（向下或向上）
order by siblings by t.id;
/*
查询结果
-----------------------------------
id | pid | sort_num  | yxbz | level
-----------------------------------
1  | 0   | 1         | Y    | 1
10 | 1   | 1         | Y    | 2
11 | 1   | 2         | Y    | 2
2  | 0   | 2         | Y    | 1
20 | 2   | 1         | Y    | 2
......
-----------------------------------
 */

-- 向上递归，通过最低级节点，递归找到根节点
select t.*,
       level -- 层级（与向下递归的层级是相反的）
from table_a t
where t.yxbz = 'Y' -- 查询条件
start with t.pid = 10 -- 指定查询的起始节点
connect by t.id = prior t.pid -- 定义父子关系，prior后跟的字段决定递归方向（向下或向上）
order by siblings by t.id;
/*
查询结果
-----------------------------------
id | pid | sort_num  | yxbz | level
-----------------------------------
10 | 1   | 1         | Y    | 1
1  | 0   | 1         | Y    | 2
-----------------------------------
 */

-- prior后跟子节点，则向下递归；prior后跟父节点，则向上递归



